Repository: giellalt/corpus-sme
Catalog: prestable/tmx/nob2sme/admin/depts/regjeringen.no/samegiella-ja-it_id_86947.html.tmx
Source language: sme
Languages: nob

source: Sámegiella ja IT
nob: Samisk språk og IT

source: Ráđđehusa ulbmil lea ahte buot almmolaš registariin galgá sáhttit geavahit sámegiela čállinmearkkaid , ja ahte dieđuid galgá sáhttit sirddašit registariid gaskka .
nob: Det er regjeringens mål at alle offentlige registre skal kunne bruke samiske tegn , og at datautvekslingen mellom registrene skal fungere .

source: Sámegiel namaid , báikenamaid , čujuhusaid jna. galgá leat vejolaš riekta registreret .
nob: Samiske navn , stedsnavn , adresser osv. må kunne registreres korrekt .

source: Danne lea ráđđehus mearridan ahte stáhta etáhtaid galgá geatnegahttit árvvoštallat lea go dárbu atnui váldit dakkár prográmmaid / geavahanvuogádagaid mat dagašedje vejolažžan geavahit sámegiela čállinmearkkaid dađistaga go dálá prográmmat molsojuvvojit .
nob: Regjeringen har derfor bestemt at statlige etater skal pålegges å vurdere behovet for å ta i bruk programvare / plattformer som gjør det mulig å bruke samisk tegnsett etter hvert som eksisterende programvare skiftes ut .

source: Vai almmolaš doaimmahusaide šattašii álkit geavahišgoahtit sámegiela čállinmearkkaid , lea Gielda- ja guovlodepartemeanta ásahan gelbbolašvuođabása ja sierra neahttasaji sámegiela čállinmearkkaid ja ITa várás – www.samit.no .
nob: For å gjøre det enklere for offentlige virksomheter å ta i bruk samisk tegnsett , har departementet etablert en kompetansebase og et eget nettsted for samisk tegnsett og IT – www.samit.no .

source: Nu leat dahkan vai almmolaš doaimmahusat galget sáhttit veahki doppe oažžut .
nob: Hensikten er at offentlig virksomheter skal kunne henvende seg dit for å få bistand .

source: Standard Norge dat doaimmaha gelbbolašvuođabása maid Gielda- ja guovlodepartemeanta ruhtada .
nob: Det er Standard Norge som driver kompetansebasen på oppdrag fra Arbeids- og inkluderingsdepartementet .

source: Raporta ja seminára – geavaheaddjiiid vásáhusat Čuolbmačilgehusat mat gusket sámegiela čállinmearkkaide ja ITii , leat máinnašuvvon máŋgga oktavuođas , ja leat earret eará ovttastuvvon ráđđehusa eNorge-plánii , ráđđehusa elektrovnnalaš sisdoalu strategiijii , ja ráđđehusa almmolaš suorggi ITa strategiijii .
nob: Rapport og seminar – brukererfaring Problemstillingene knyttet til samisk tegnsett og IT er omtalt i en rekke sammenhenger , og er integrert blant annet i regjeringens e Norge-plan , i regjeringens strategi for elektronisk innhold , og i regjeringens strategi for IT i offentlig sektor .

source: Bargo- ja searvadahttindepartemeanta okttiiordne barggu ja guovddáš ovttasbargit leat Ealáhus- ja gávhedepartemeanta ja Sámediggi .
nob: Arbeids- og inkluderingsdepartementet samordner arbeidet , med Nærings- og handelsdepartementet og Sametinget som sentrale samarbeidspartnere .

source: Bargojoavku mas leat máŋgga departemeantta ja Sámedikki oassálastit geigii guovvamánus 2002 ráportta ” Samisk tegnsett og IT ” ( sámegiela čállinmearkkat ja IT ) .
nob: En arbeidsgruppe med deltakere fra flere departementer og Sametinget la i februar 2002 fram rapporten ” Samisk tegnsett og IT ” .

source: Ráporta lea leamaš gulaskuddamis .
nob: Rapporten har vært på høring .

source: Hui stuorra eanetlohku gulaskuddancealkámušain doarju ahte boahtteáiggi prográmmaođasmahttimat galget heivehuvvot sámegillii , ja vel eará gielaide ge mat eambbo ja eambbo geavahuvvojit Norggas .
nob: Et overveidende flertall av høringsuttalelsene er positive til at framtidige oppgraderinger av programvare skal støtte samisk , og også andre språk som i stadig større grad brukes i Norge .

source: Norsk teknologisenter ( Norgga teknologiijaguovddáš ) ja Gielda- ja guovlodepartemeanta dolle seminára geassemánus 2002 masa earret eará Brønnøysund-registariid , Aetata , Stáhta kártadoaimmahaga , Stáhta hálddahusbálvalusa , ja Sámedikki ovddasteaddjit oassálaste ja lonohalle vásáhusaid .
nob: Norsk teknologisenter og Kommunal- og regionaldepartementet avholdt et seminar i juni 2002 der representanter fra bl.a. Brønnøysundregistrene , Aetat , Statens kartverk , Statens forvaltningstjeneste og Sametinget var til stede og utvekslet erfaringer .

source: Dát bođii ovdan :
nob: Følgende kom fram :

source: Unicode bokte lea dihtorealáhus ásahan ođđa standárdda ( ISO / IEC 10646-X ) , earret eará sámegiela čállinmearkkaid čoavddusin .
nob: Gjennom Unicode har databransjen innført en ny standard ( ISO / IEC 10646-X ) , for løsing av blant annet samiske tegn .

source: Dán standárdda sáhttet buohkat geavahit .
nob: Denne standarden kan alle bruke .

source: Unicode bokte eai leat šat matge teknihkalaš hehttehusaid mat cakkašedje almmolaš orgánaid geavaheames sámegiela čállinmearkkaid ovdamearkka dihtii almmolaš registariin .
nob: Gjennom Unicode er det ikke lengre tekniske hindre for at offentlige organer skal kunne bruke samiske tegn i for eksempel i offentlige registre .

source: Hástalusat čatnasit dieđuid lonuhallamii boarráset vuogádagaiguin .
nob: Utfordringene er knyttet til utveksling av data i eldre systemer .

source: Dain eai leat dál galle vuogádaga mat sáhttet vuostáiváldit sámegiela čállinmearkkaid .
nob: Av disse er det pr. i dag få systemer som kan ta imot samiske tegn .

source: Go , erenoamážit dihtorprográmmat molsojuvvojit / ođastuvvojit de galget etáhtat fuolahit ahte ođđa prográmmat heivejit Unicodii .
nob: Når , spesielt databaseprogrammer skiftes ut / oppgraderes må de enkelte etatene påse at de nye programmene vil ha full støtte for Unicode .

source: Davviriikkalaš ovttasbargu Norga lea ovttas Ruoŧain ja Suomain dorjon sámegiela oktasaš dihtorstandárdenvuogádaga .
nob: Nordisk samarbeid Norge har sammen med Sverige og Finland støttet et felles datastandardiserings ­opplegg av samisk språk .

source: Dát sáhttá dasa váikkuhit ahte sámegiella oažžu stuorát gudneárvvu márkana dáfus .
nob: Dette kan bidra til at samisk språk markedsmessig får større status .

source: Sávahahtti livččii gilvalahttit daid dihtorskáhppojeaddjiid mat fállet iežaset buktagiid almmolaš ásahusaide .
nob: Det er ønskelig å skjerpe konkurransen mellom dataleverandørene som tilbyr sine produkter til det offentlige .

source: Iežaset čoahkkima oktavuođas skábmamánus 2002 ávžžuhedje Suoma , Norgga ja Ruoŧa sámeministarat ja sámediggepresideanttat dihtorindustriija johtileamos lági mielde heivehit iežaset buktagiid sámegillii .
nob: I forbindelse med sitt møte i november 2002 oppfordret sameministerne og sametingspresidentene i Finland , Norge og Sverige dataindustrien til snarest å utvikle støtte for samisk språk i sine produkter .

source: Dál lea vuođđuduvvon Davviriikkaid ámmátolbmoorgána vuollásaš bargolávdegoddi man bargun lea oktiiordnet dáid cuolbmačilgehusaid davviriikkalaš dásis .
nob: Det er nedsatt en arbeidsgruppe under Nordisk embetsmannsorgan for samiske spørsmål som skal samordne disse problemstillingene på nordisk nivå .
